[Killed] BlockStatement
lib/filtering.ts:6:14
 export function filterProducts(
   items: Product[],
   activeCategory: Category | "All",
-): Product[] {
-  if (activeCategory === "All") {
-    return items;
-  }
-
-  return items.filter((item) => item.category === activeCategory);
-}
+): Product[] {}
 
killedBy: filterProducts returns all products for All category
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
lib/filtering.ts:7:7
   items: Product[],
   activeCategory: Category | "All",
 ): Product[] {
-  if (activeCategory === "All") {
+  if (true) {
     return items;
   }
killedBy: filterProducts returns only Office products for Office category
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/filtering.ts:7:33
   items: Product[],
   activeCategory: Category | "All",
 ): Product[] {
-  if (activeCategory === "All") {
-    return items;
-  }
+  if (activeCategory === "All") {}
 
   return items.filter((item) => item.category === activeCategory);
killedBy: filterProducts returns all products for All category
statusReason: expected [] to have a length of 10 but got +0

[Killed] ConditionalExpression
lib/filtering.ts:11:33
     return items;
   }
 
-  return items.filter((item) => item.category === activeCategory);
+  return items.filter((item) => true);
 }
 
killedBy: filterProducts returns only Office products for Office category
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/filtering.ts:11:33
     return items;
   }
 
-  return items.filter((item) => item.category === activeCategory);
+  return items.filter((item) => item.category !== activeCategory);
 }
 
killedBy: filterProducts returns only Office products for Office category
statusReason: expected false to be true // Object.is equality
