[Killed] ArrayDeclaration
src/lib/validation.js:1:31
-const requiredProductFields = [
-  'id',
-  'slug',
-  'name',
-  'category',
-  'shortDescription',
-  'detailDescription',
-  'image'
-]
+const requiredProductFields = []
 
 export function validateCatalogData(data) {
killedBy: validation throws when required product field is missing
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/validation.js:3:3
 const requiredProductFields = [
   'id',
-  'slug',
+  "",
   'name',
   'category',
killedBy: validation accepts valid dataset
statusReason: One or more products are incomplete.

[Killed] StringLiteral
src/lib/validation.js:5:3
   'id',
   'slug',
   'name',
-  'category',
+  "",
   'shortDescription',
   'detailDescription',
killedBy: validation accepts valid dataset
statusReason: One or more products are incomplete.

[Killed] BooleanLiteral
src/lib/validation.js:12:7
 ]
 
 export function validateCatalogData(data) {
-  if (!data || !Array.isArray(data.categories) || !Array.isArray(data.products)) {
+  if (data || !Array.isArray(data.categories) || !Array.isArray(data.products)) {
     throw new Error('Catalog data is unavailable at the moment.')
   }
killedBy: validation accepts valid dataset
statusReason: Catalog data is unavailable at the moment.

[Killed] ConditionalExpression
src/lib/validation.js:12:7
 ]
 
 export function validateCatalogData(data) {
-  if (!data || !Array.isArray(data.categories) || !Array.isArray(data.products)) {
+  if (true) {
     throw new Error('Catalog data is unavailable at the moment.')
   }
killedBy: validation accepts valid dataset
statusReason: Catalog data is unavailable at the moment.

[Killed] ArrowFunction
src/lib/validation.js:16:52
     throw new Error('Catalog data is unavailable at the moment.')
   }
 
-  const categoryKeys = new Set(data.categories.map((category) => category.key))
+  const categoryKeys = new Set(data.categories.map(() => undefined))
   const ids = new Set()
   const slugs = new Set()
killedBy: validation accepts valid dataset
statusReason: Product category mapping is invalid.

[Killed] BlockStatement
src/lib/validation.js:20:40
   const ids = new Set()
   const slugs = new Set()
 
-  for (const product of data.products) {
-    for (const field of requiredProductFields) {
-      if (!product[field] || typeof product[field] !== 'string') {
-        throw new Error('One or more products are incomplete.')
-      }
-    }
-
-    if (ids.has(product.id) || slugs.has(product.slug)) {
-      throw new Error('Product data contains duplicate entries.')
-    }
-
-    if (!categoryKeys.has(product.category)) {
-      throw new Error('Product category mapping is invalid.')
-    }
-
-    ids.add(product.id)
-    slugs.add(product.slug)
-  }
+  for (const product of data.products) {}
 
   return true
killedBy: validation throws on duplicate products
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/validation.js:21:48
   const slugs = new Set()
 
   for (const product of data.products) {
-    for (const field of requiredProductFields) {
-      if (!product[field] || typeof product[field] !== 'string') {
-        throw new Error('One or more products are incomplete.')
-      }
-    }
+    for (const field of requiredProductFields) {}
 
     if (ids.has(product.id) || slugs.has(product.slug)) {
killedBy: validation throws when required product field is missing
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/validation.js:22:30
 
   for (const product of data.products) {
     for (const field of requiredProductFields) {
-      if (!product[field] || typeof product[field] !== 'string') {
+      if (!product[field] || typeof product[field] === 'string') {
         throw new Error('One or more products are incomplete.')
       }
killedBy: validation accepts valid dataset
statusReason: One or more products are incomplete.

[Killed] BooleanLiteral
src/lib/validation.js:22:11
 
   for (const product of data.products) {
     for (const field of requiredProductFields) {
-      if (!product[field] || typeof product[field] !== 'string') {
+      if (product[field] || typeof product[field] !== 'string') {
         throw new Error('One or more products are incomplete.')
       }
killedBy: validation accepts valid dataset
statusReason: One or more products are incomplete.

[Killed] StringLiteral
src/lib/validation.js:23:25
   for (const product of data.products) {
     for (const field of requiredProductFields) {
       if (!product[field] || typeof product[field] !== 'string') {
-        throw new Error('One or more products are incomplete.')
+        throw new Error("")
       }
     }
killedBy: validation throws when required product field is missing
statusReason: expected [Function] to throw error including 'incomplete' but got ''

[Killed] ConditionalExpression
src/lib/validation.js:27:9
       }
     }
 
-    if (ids.has(product.id) || slugs.has(product.slug)) {
+    if (false) {
       throw new Error('Product data contains duplicate entries.')
     }
killedBy: validation throws on duplicate products
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/lib/validation.js:27:9
       }
     }
 
-    if (ids.has(product.id) || slugs.has(product.slug)) {
+    if (ids.has(product.id) && slugs.has(product.slug)) {
       throw new Error('Product data contains duplicate entries.')
     }
killedBy: validation throws on duplicate products
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/validation.js:28:23
     }
 
     if (ids.has(product.id) || slugs.has(product.slug)) {
-      throw new Error('Product data contains duplicate entries.')
+      throw new Error("")
     }
 
killedBy: validation throws on duplicate slug
statusReason: expected [Function] to throw error including 'duplicate entries' but got ''

[Killed] ConditionalExpression
src/lib/validation.js:31:9
       throw new Error('Product data contains duplicate entries.')
     }
 
-    if (!categoryKeys.has(product.category)) {
+    if (true) {
       throw new Error('Product category mapping is invalid.')
     }
killedBy: validation accepts valid dataset
statusReason: Product category mapping is invalid.

[Killed] ConditionalExpression
src/lib/validation.js:31:9
       throw new Error('Product data contains duplicate entries.')
     }
 
-    if (!categoryKeys.has(product.category)) {
+    if (false) {
       throw new Error('Product category mapping is invalid.')
     }
killedBy: validation throws when product category is unknown
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/validation.js:32:23
     }
 
     if (!categoryKeys.has(product.category)) {
-      throw new Error('Product category mapping is invalid.')
+      throw new Error("")
     }
 
killedBy: validation throws when product category is unknown
statusReason: expected [Function] to throw error including 'category mapping is invalid' but got ''
