[Killed] BlockStatement
src/lib/filters.js:1:49
-export function getSortedCategories(categories) {
-  return [...categories].sort((a, b) => a.sortOrder - b.sortOrder)
-}
+export function getSortedCategories(categories) {}
 
 export function filterProductsByCategory(products, selectedCategory) {
killedBy: filters sorts categories by sortOrder
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
src/lib/filters.js:2:31
 export function getSortedCategories(categories) {
-  return [...categories].sort((a, b) => a.sortOrder - b.sortOrder)
+  return [...categories].sort(() => undefined)
 }
 
killedBy: filters sorts categories by sortOrder
statusReason: expected 'b' to be 'a' // Object.is equality

[Killed] MethodExpression
src/lib/filters.js:2:10
 export function getSortedCategories(categories) {
-  return [...categories].sort((a, b) => a.sortOrder - b.sortOrder)
+  return [...categories]
 }
 
killedBy: filters sorts categories by sortOrder
statusReason: expected 'b' to be 'a' // Object.is equality

[Killed] BlockStatement
src/lib/filters.js:5:70
   return [...categories].sort((a, b) => a.sortOrder - b.sortOrder)
 }
 
-export function filterProductsByCategory(products, selectedCategory) {
-  if (!selectedCategory) {
-    return products
-  }
-  return products.filter((product) => product.category === selectedCategory)
-}
+export function filterProductsByCategory(products, selectedCategory) {}
 
killedBy: filters filters products by selected category
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/lib/filters.js:6:7
 }
 
 export function filterProductsByCategory(products, selectedCategory) {
-  if (!selectedCategory) {
+  if (true) {
     return products
   }
killedBy: filters filters products by selected category
statusReason: expected [ { id: '1', category: 'milk' }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/lib/filters.js:6:7
 }
 
 export function filterProductsByCategory(products, selectedCategory) {
-  if (!selectedCategory) {
+  if (false) {
     return products
   }
killedBy: filters filters products by selected category
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/lib/filters.js:9:39
   if (!selectedCategory) {
     return products
   }
-  return products.filter((product) => product.category === selectedCategory)
+  return products.filter((product) => product.category !== selectedCategory)
 }
 
killedBy: filters filters products by selected category
statusReason: expected [ { id: '1', category: 'milk' }, …(1) ] to have a length of +0 but got 2

[Killed] MethodExpression
src/lib/filters.js:9:10
   if (!selectedCategory) {
     return products
   }
-  return products.filter((product) => product.category === selectedCategory)
+  return products
 }
 
killedBy: filters filters products by selected category
statusReason: expected [ { id: '1', category: 'milk' }, …(1) ] to have a length of 1 but got 2
